index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-05-28 Fri 22:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The CAPM</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Matt Brigida, Ph.D." />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">The CAPM</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4afd896">1. 5MF Presentations</a></li>
<li><a href="#org4861470">2. Overview</a></li>
<li><a href="#orgb4084db">3. Expected Return and Variance</a>
<ul>
<li><a href="#orgea33a96">3.1. Single Asset</a></li>
<li><a href="#org1644ae7">3.2. Portfolio</a>
<ul>
<li><a href="#orga056c07">3.2.1. Optional:  Portfolio of Two Assets Video</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgec1cd92">4. The CAPM, A Short Version</a>
<ul>
<li><a href="#org6f07fa4">4.1. Realized Returns</a></li>
<li><a href="#orgda302b6">4.2. Systematic Risk Principle</a></li>
<li><a href="#org64cd482">4.3. Define \(\beta\)</a></li>
<li><a href="#org3e68f10">4.4. The Reward to Risk Ratio</a></li>
<li><a href="#org1641b42">4.5. The CAPM</a>
<ul>
<li><a href="#org60e0a8b">4.5.1. Interpretation</a></li>
<li><a href="#org8173a4b">4.5.2. Stock with low correlations&#x2026;</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org04548bd">5. Insights from the CAPM</a>
<ul>
<li><a href="#org2aded42">5.1. The effect of correlation on portfolio risk</a></li>
</ul>
</li>
<li><a href="#org315347d">6. Applied CAPM: Calculating Beta</a></li>
<li><a href="#orgabb8462">7. Optional: A CAPM video appropriate to an Intro to Finance Course</a></li>
<li><a href="#org2b15899">8. Optional: A slightly more advanced treatment of the CAPM</a></li>
</ul>
</div>
</div>

<div id="outline-container-org4afd896" class="outline-2">
<h2 id="org4afd896"><span class="section-number-2">1.</span> 5MF Presentations</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://www.5minutefinance.org/concepts/the-capital-asset-pricing-model">https://www.5minutefinance.org/concepts/the-capital-asset-pricing-model</a>
</p>

<p>
<a href="https://www.5minutefinance.org/concepts/mean-variance-portfolio-optimization">https://www.5minutefinance.org/concepts/mean-variance-portfolio-optimization</a>
</p>
</div>
</div>

<div id="outline-container-org4861470" class="outline-2">
<h2 id="org4861470"><span class="section-number-2">2.</span> Overview</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>We know how to calculate cash flows and move them around in time given a discount rate.  We also know where to apply these tools&#x2014;to stock and bond valuation, investment decision rules, etc.  The last step is to figure out how to get the discount rate.  The CAPM will help us do this.</li>
<li>The CAPM will allow us to <i>understand what we mean by risk</i>.</li>
<li>The CAPM result: <b>you are not paid for taking unnecessary risks</b>.</li>
</ul>
</div>
</div>

<div id="outline-container-orgb4084db" class="outline-2">
<h2 id="orgb4084db"><span class="section-number-2">3.</span> Expected Return and Variance</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgea33a96" class="outline-3">
<h3 id="orgea33a96"><span class="section-number-3">3.1.</span> Single Asset</h3>
</div>

<div id="outline-container-org1644ae7" class="outline-3">
<h3 id="org1644ae7"><span class="section-number-3">3.2.</span> Portfolio</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Say we have two stocks in our portfolio, \(A\) and \(B\).  The <code>Expected Return</code> of our portfolio is:
</p>

<p>
\[E(R_p) = w_AE(R_A) + w_BE(R_B)\]
</p>

<p>
where \(w_A\) and \(w_B\) are the weights in asset \(A\) and \(B\) respectively.
</p>

<p>
The portfolio variance is then:
</p>

<p>
\[\sigma_p^2 = w^2_A\sigma_A^2 + w^2_B\sigma_B^2 + 2w_Aw_B\sigma_A\sigma_B\rho_{A,B}\]
</p>
</div>

<div id="outline-container-orga056c07" class="outline-4">
<h4 id="orga056c07"><span class="section-number-4">3.2.1.</span> Optional:  Portfolio of Two Assets Video</h4>
<div class="outline-text-4" id="text-3-2-1">
<iframe width="560" height="315" src="https://www.youtube.com/embed/dpB5fx5lbA8" frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
</div>
</div>
</div>
</div>

<div id="outline-container-orgec1cd92" class="outline-2">
<h2 id="orgec1cd92"><span class="section-number-2">4.</span> The CAPM, A Short Version</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org6f07fa4" class="outline-3">
<h3 id="org6f07fa4"><span class="section-number-3">4.1.</span> Realized Returns</h3>
<div class="outline-text-3" id="text-4-1">
<p>
\[R_A = E(R_A) + U_A\]
</p>

<p>
\[R_A = E(R_A) + m + e_A\]
</p>

<p>
the key idea is as we for a portfolio, \(e_A\), \(e_B\), \(e_C\), etc cancel each other out.  So via diversification we can remove the unsystematic (firm-specific) risk.
</p>
</div>
</div>

<div id="outline-container-orgda302b6" class="outline-3">
<h3 id="orgda302b6"><span class="section-number-3">4.2.</span> Systematic Risk Principle</h3>
<div class="outline-text-3" id="text-4-2">
<blockquote>
<p>
An asset's expected return depends only on that asset's systematic (nondiversifiable) risk (not on nondiversifiable risk) (it also depends on other market wide factors).
</p>
</blockquote>

<p>
The idea is if you don't have to hold the risk, you will not be compensated for doing so.
</p>
</div>
</div>

<div id="outline-container-org64cd482" class="outline-3">
<h3 id="org64cd482"><span class="section-number-3">4.3.</span> Define \(\beta\)</h3>
<div class="outline-text-3" id="text-4-3">
<p>
We'll define \(\beta_A\) as the amount of systematic risk in asset <i>A</i> relative to the average asset.  The average asset has a \(\beta\) equal to 1.  The average asset is the same as the market.  
</p>
</div>
</div>

<div id="outline-container-org3e68f10" class="outline-3">
<h3 id="org3e68f10"><span class="section-number-3">4.4.</span> The Reward to Risk Ratio</h3>
<div class="outline-text-3" id="text-4-4">
<ul class="org-ul">
<li>\(E(R_A) - r_f\) is what we expect to gain from investing in a risky asset \(A\) (it is our <code>reward</code>).</li>
<li>Since we are diversified, our risk from investing in asset \(A\) is \(\beta_A\).</li>
</ul>

<p>
Thus our <code>reward-per-unit-risk</code> (Reward to Risk Ratio) is:
</p>

<p>
\[\frac{E(R_A) - r_f}{\beta_A}\]
</p>
</div>
</div>

<div id="outline-container-org1641b42" class="outline-3">
<h3 id="org1641b42"><span class="section-number-3">4.5.</span> The CAPM</h3>
<div class="outline-text-3" id="text-4-5">
<p>
Via equilibrium argument:
</p>

<p>
\[\frac{E(R_X) - r_f}{\beta_X} = \frac{E(R_Y) - r_f}{\beta_Y} = E(R_m) - r_f\]
</p>

<p>
for all capital assets \(X\) and \(Y\).  
</p>

<p>
Given the market portfolio is also a capital asset, and \(\beta_m = 1\), we have:
</p>

<p>
\[E(R_X) = r_f + \beta_X(E(R_m) - r_f)\]
</p>

<p>
for any capital asset \(X\).
</p>
</div>

<div id="outline-container-org60e0a8b" class="outline-4">
<h4 id="org60e0a8b"><span class="section-number-4">4.5.1.</span> Interpretation</h4>
<div class="outline-text-4" id="text-4-5-1">
<p>
The expected return on any capital asset is a function of:
</p>

<ul class="org-ul">
<li>\(r_f\) the risk free rate, which is <b>the pure time value of money</b>.</li>
<li>\(\beta_X\), the amount of systematic risk in the asset \(X\).</li>
<li>\(E(R_m) - r_f\), the <b>market risk premium</b>, which is the market-wide cost of bearing a unit of systematic risk.</li>
</ul>

<p>
So you can read the CAPM as:
</p>

<blockquote>
<p>
The expected return on any asset is equal to the pure time value of money plus the product of the amount of systematic risk in the asset and the cost of systematic risk.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org8173a4b" class="outline-4">
<h4 id="org8173a4b"><span class="section-number-4">4.5.2.</span> Stock with low correlations&#x2026;</h4>
<div class="outline-text-4" id="text-4-5-2">
<p>
Stock with low amount of systematic risk will have low beta coefficients (\(\beta_X = \frac{Cov(R_X, R_m)}{\sigma^2_m}\)) and thus will have low expected returns.  That is, you only require low returns for assets that serve as a market hedge.  Remember:
</p>

<blockquote>
<p>
An asset's risk is not its standard deviation, but in how much that asset increases your portfolio's standard deviation when it is added (which is the \(\beta\)).
</p>
</blockquote>
</div>
</div>
</div>
</div>





<div id="outline-container-org04548bd" class="outline-2">
<h2 id="org04548bd"><span class="section-number-2">5.</span> Insights from the CAPM</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>A Risky Stock Can Make Your Portfolio Safer</li>
</ul>
</div>


<div id="outline-container-org2aded42" class="outline-3">
<h3 id="org2aded42"><span class="section-number-3">5.1.</span> The effect of correlation on portfolio risk</h3>
<div class="outline-text-3" id="text-5-1">
<iframe width="560" height="315" src="https://micfm.shinyapps.io/The_CAPM_app1/"> </iframe>
</div>
</div>
</div>





<div id="outline-container-org315347d" class="outline-2">
<h2 id="org315347d"><span class="section-number-2">6.</span> Applied CAPM: Calculating Beta</h2>
<div class="outline-text-2" id="text-6">
<iframe width="560" height="315" src="https://micfm.shinyapps.io/The_CAPM_app2/"></iframe>
</div>
</div>


<div id="outline-container-orgabb8462" class="outline-2">
<h2 id="orgabb8462"><span class="section-number-2">7.</span> Optional: A CAPM video appropriate to an Intro to Finance Course</h2>
<div class="outline-text-2" id="text-7">
<iframe width="560" height="315" src="https://www.youtube.com/embed/5vQL-50itig" frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
</div>
</div>


<div id="outline-container-org2b15899" class="outline-2">
<h2 id="org2b15899"><span class="section-number-2">8.</span> Optional: A slightly more advanced treatment of the CAPM</h2>
<div class="outline-text-2" id="text-8">
<iframe width="560" height="315" src="https://www.youtube.com/embed/coJl_aCBTuA" frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Matt Brigida, Ph.D.</p>
<p class="date">Created: 2021-05-28 Fri 22:16</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
